{
  "results": [
    {
      "title": "UVA President Steps Down Amid Pressure from Trump Administration",
      "description": "(MENAFN) James Ryan, President of the University of Virginia (UVA), has agreed to step down following mounting pressure from the Trump administration, media reported on Friday. The U.S. Department ...",
      "image_url": "https://menafn.com/updates/pr/Menafn_News_Images%5Clocal_businessfinance_283.jpg",
      "link": "https://menafn.com/1109735119/UVA-President-Steps-Down-Amid-Pressure-from-Trump-Administration"
    },
    {
      "title": "Flamengo Gerson is the target of a dispute between Cristiano Ronaldo’s Al-Nassr and Zenit for R$160 million",
      "description": "In a move shaking up the transfer market, Flamengo’s midfielder Gerson has become the center of an international tug-of-war between Saudi Arabia’s Al-Nassr and Russia’s Zenit, with his €25 million (approximately R$160 million) release clause at the heart of negotiations. The Saudi club, led by Portuguese coach Jorge Jesus, who is close to signing with [...]O post Flamengo Gerson is the target of a dispute between Cristiano Ronaldo’s Al-Nassr and Zenit for R$160 million apareceu primeiro em Mix Vale.",
      "image_url": "https://www.mixvale.com.br/wp-content/uploads/2025/03/Gerson.jpg",
      "link": "https://www.mixvale.com.br/2025/06/28/flamengo-gerson-is-the-target-of-a-dispute-between-cristiano-ronaldos-al-nassr-and-zenit-for-r160-million/"
    },
    {
      "title": "Where to watch Flamengo vs Bayern live: decisive duel in the Club World Cup shakes up Miami this Sunday",
      "description": "Flamengo and Bayern Munich face off this Sunday, June 29, 2025, at 5:00 PM (Brasília time), in a thrilling round of 16 match of the 2025 Club World Cup at Hard Rock Stadium in Miami. The game, pitting the Group D leader against the Group C runner-up, marks a historic first official meeting between the [...]O post Where to watch Flamengo vs Bayern live: decisive duel in the Club World Cup shakes up Miami this Sunday apareceu primeiro em Mix Vale.",
      "image_url": "https://www.mixvale.com.br/wp-content/uploads/2025/06/Flamengo-x-Chelsea.jpg",
      "link": "https://www.mixvale.com.br/2025/06/28/where-to-watch-flamengo-vs-bayern-live-decisive-duel-in-the-club-world-cup-shakes-up-miami-this-sunday/"
    }
  ]
}