{
  "results": [
    {
      "title": "Knockout stage of 2025 Club World Cup begins with Palmeiras vs. Botafogo and decisive matches; knockout match times and venues revealed",
      "description": "The knockout phase of the FIFA Club World Cup 2025, hosted in the United States, begins this Saturday, June 28, with a match set to captivate Brazil: Palmeiras faces Botafogo at 1:00 PM (Brasília time) at Lincoln Financial Field in Philadelphia, in the round of 16. All four Brazilian clubs—Palmeiras, Botafogo, Flamengo, and Fluminense—advanced from [...]O post Knockout stage of 2025 Club World Cup begins with Palmeiras vs. Botafogo and decisive matches; knockout match times and venues revealed apareceu primeiro em Mix Vale.",
      "image_url": "https://www.mixvale.com.br/wp-content/uploads/2025/06/Mundial-de-Clubes-2025-7.jpg",
      "link": "https://www.mixvale.com.br/2025/06/27/knockout-stage-of-2025-club-world-cup-begins-with-palmeiras-vs-botafogo-and-decisive-matches-knockout-match-times-and-venues-revealed/"
    },
    {
      "title": "Pickleball Equipment Market To Surge From USD 1.61 Billion To USD 3.1 Billion By 2032 - Meticulous Research®",
      "description": "(MENAFN - PR Newswire) Sport's Explosive Growth, Rising Professional Leagues, and Increasing Infrastructure Investment Drive 10.3% CAGR Growth Across Global Markets REDDING, Calif., June 27, ...",
      "image_url": null,
      "link": "https://menafn.com/1109734210/Pickleball-Equipment-Market-To-Surge-From-USD-161-Billion-To-USD-31-Billion-By-2032-Meticulous-Research"
    },
    {
      "title": "Reborn babies: costs, customization and passion on the rise",
      "description": "The passion for reborn babies has transformed the collectibles market, drawing thousands of enthusiasts who invest in hyper-realistic dolls. These meticulously crafted pieces, designed to mimic newborns, have gained traction in fairs, social media, and specialty stores, fueling a sector that blends art and emotion. In 2025, the reborn market is expanding, with prices ranging [...]O post Reborn babies: costs, customization and passion on the rise apareceu primeiro em Mix Vale.",
      "image_url": "https://www.mixvale.com.br/wp-content/uploads/2025/04/Boneco-bebe-reborn.jpg",
      "link": "https://www.mixvale.com.br/2025/06/27/reborn-babies-costs-customization-and-passion-on-the-rise/"
    }
  ]
}