{
  "results": [
    {
      "title": "⚠️ After World Cup exit, Botafogo sack Renato Paiva",
      "description": "Renato Paiva is no longer the coach of Botafogo.The club announced the dismissal of the 55-year-old Portuguese coach early Monday morning (30).The decision was made after the elimination of Glorioso i...",
      "image_url": "https://media.zenfs.com/en/onefootball_articles_802/c9067bb27d7bdd239cc63267a93933a6",
      "link": "https://ca.sports.yahoo.com/news/world-cup-exit-botafogo-sack-040400818.html"
    },
    {
      "title": "Jury due to begin deliberating in Sean ‘Diddy’ Combs’ sex trafficking trial",
      "description": "Jurors are set to start deliberating Monday in Sean “Diddy” Combs ’ sex trafficking case, weighing charges that could put the hip-hop mogul in prison for life. After receiving legal instructions from federal Judge Arun Subramanian, the jury of eight men and four women will head behind closed doors to deliberate. Combs, 55, has pleaded not guilty to federal charges of racketeering conspiracy, two counts of sex trafficking — relating to two of his ex-girlfriends — and two counts of transportation to engage in prostitution for allegedly arranging to fly sex workers across state lines.",
      "image_url": "https://s.yimg.com/ny/api/res/1.2/tVtx7QVuBjNxnxohQHxreg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTc-/https://media.zenfs.com/en/ap.org/92d4adf41e5d86e086932a303da28562",
      "link": "https://ca.news.yahoo.com/jury-due-begin-deliberating-sean-040336934.html"
    },
    {
      "title": "A week into the fragile Israel-Iran peace agreement, here's what we still don't know",
      "description": "DUBAI, United Arab Emirates (AP) — It's been a week since the United States pressed Israel and Iran into a truce, ending a bloody, 12-day conflict that had set the Middle East and globe on edge.",
      "image_url": "https://bloximages.chicago2.vip.townnews.com/thestar.com/content/tncms/assets/v3/editorial/d/2d/d2d48551-b400-526c-8a2b-f415a87a7b20/68620e18d5b75.image.jpg?resize=300%2C144",
      "link": "https://www.thestar.com/news/world/middle-east/a-week-into-the-fragile-israel-iran-peace-agreement-heres-what-we-still-dont-know/article_753d7b7e-1535-5609-b483-bb7b8e0a806c.html"
    }
  ]
}