{
  "results": [
    {
      "title": "Patrese: Every Formula 1 team would like to have Verstappen",
      "description": "GRANDPRIX247.comIn-Depth & Independent Formula 1 News All The TimeAs if they met before the Austrian Grand Prix weekend to plot it, Formula 1 veteran drivers have collectively decided to kick-start the Silly Season by weighing in on Max Verstappen’s uncertain future at Red Bull. Riccardo Patrese is the latest in a line of F1 race winners and champions, including Jacques Villeneuve, Johnny Herbert and Juan Pablo Montoya, to offer advice to Verstappen as he contemplates a future with any team he wants to race for. Top of the [...]The post Patrese: Every Formula 1 team would like to have Verstappen appeared first on GRANDPRIX247.",
      "image_url": "https://www.grandprix247.com/wp-content/uploads/2025/06/SI202506270682.jpg",
      "link": "https://www.grandprix247.com/2025/06/28/patrese-every-f1-team-would-like-to-have-verstappen-aston-martin-mercedes/"
    },
    {
      "title": "Wolff call for fining teams who submit “long shot” protests",
      "description": "GRANDPRIX247.comIn-Depth & Independent Formula 1 News All The TimeMercedes boss Toto Wolff, speaking to the media at the Austrian Grand Prix in Spielberg on Friday, said Formula 1 teams should be fined if they fail in ‘long shot’ protests against rivals. The Austrian told reporters at his home grand prix that the governing FIA was already looking into the possibility of such a measure. Rivals Red Bull have protested twice in the space of five races, and without success, against Mercedes driver George Russell. In Canada two weeks ago, [...]The post Wolff call for fining teams who submit “long shot” protests appeared first on GRANDPRIX247.",
      "image_url": "https://www.grandprix247.com/wp-content/uploads/2023/07/horner-wolff-united-f1-andretti.jpg",
      "link": "https://www.grandprix247.com/2025/06/28/wolff-call-for-fining-teams-who-submit-long-shot-protests/"
    },
    {
      "title": "German Masters: Diksha Dagar And Vani Kapoor In Top 10",
      "description": "(MENAFN - IANS) Hamburg, June 28 (IANS) Diksha Dagar and Vani Kapoor were the pick of the Indians at the Amundi German Masters after the second day. With Avani Prashanth also making the cut, three ...",
      "image_url": "https://menafn.com/updates/pr/2025-06/28/I_3a6c1image_story.jpeg",
      "link": "https://menafn.com/1109735313/German-Masters-Diksha-Dagar-And-Vani-Kapoor-In-Top-10"
    }
  ]
}