{
  "results": [
    {
      "title": "Alex Bregman's wife Reagan Bregman turns heads in NYC as agent Scott Boras hints at new Red Sox contract",
      "description": "Amidst Alex Bregman's challenging season and injury concerns with the Boston Red Sox, his wife, Reagan Bregman, recently enjoyed a vibrant trip to New York City. Reagan shared glimpses of her culinary adventures on Instagram, while Bregman's manager, Scott Boras, hinted at potential contract discussions with the team.",
      "image_url": "https://static.toiimg.com/thumb/msid-122119423,imgsize-1063515,width-400,resizemode-4/122119423.jpg",
      "link": "https://timesofindia.indiatimes.com/sports/mlb/news/alex-bregmans-wife-reagan-bregman-turns-heads-in-nyc-as-agent-scott-boras-hints-at-new-red-sox-contract/articleshow/122116058.cms"
    },
    {
      "title": "Danny Green sparks NBA buzz after naming Victor Wembanyama and De’Aaron Fox as dream San Antonio Spurs duo",
      "description": "Danny Green's recent comment has created excitement among NBA fans. He expressed his eagerness to watch Victor Wembanyama and De'Aaron Fox play together. Green specifically mentioned the San Antonio Spurs. This suggestion has led to speculation about a potential partnership. Fans are excited about the possibility of seeing this duo on the court.",
      "image_url": "https://static.toiimg.com/thumb/msid-122119422,width-1070,height-580,imgsize-1169558,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "link": "https://timesofindia.indiatimes.com/sports/nba/top-stories/danny-green-sparks-nba-buzz-after-naming-victor-wembanyama-and-deaaron-fox-as-dream-san-antonio-spurs-duo/articleshow/122118876.cms"
    },
    {
      "title": "NASCAR Xfinity Series 2025: Prize money for Focused Health 250 at EchoPark Speedway",
      "description": "After the Explore the Pocono Mountains 250, the 2025 NASCAR Xfinity Series season heads to EchoPark Speedway for the Focused Health 250.",
      "image_url": null,
      "link": "https://www.sportskeeda.com/nascar/nascar-xfinity-series-2025-prize-money-focused-health-250-echopark-speedway"
    }
  ]
}