{
  "results": [
    {
      "title": "Innovent Biologics Showcases \"Dual Innovations\" at Oncology R&D Day, Pioneering the Future of Cancer Treatment with Next-Generation IO and ADC Platforms",
      "description": "SAN FRANCISCO and SUZHOU, China, June 30, 2025 /PRNewswire/ -- Innovent Biologics, Inc. (\"Innovent\") (HKEX: 01801), a world-class biopharmaceutical company that develops, manufactures, and commercializes high-quality medicines for the treatment of oncology, autoimmune, cardiovascular and metabolic, ophthalmology, and other major diseases, held its Oncology R&D Day, unveiling its forward-looking strategy centered on dual innovation in next-generation immuno-oncology (IO) and antibody-drug conjugate (ADC) technologies. This strategic focus aims to redefine the standards of cancer treatment and propel Innovent toward becoming a global, premier biopharmaceutical leader. The event drew over 500 participants, including leading oncology key opinion leaders (KOLs), principal investigators, analysts, and global investors, signaling strong engagement with Innovent's transformative vision for the future of oncology. Keynote speech \"Over the past decade, Innovent has been at the forefront of China's biopharmaceutical evolution—pioneering the PD-1 immunotherapy era and building China's leading oncology brand, with over 3 million cancer patients treated with our therapies,\" said Dr. Michael Yu, Founder, Chairman of the Board and CEO of Innovent. \"We are entering a new chapter focused on global innovation, powered by a robust pipeline and dual innovation of next-generation IO and next-generation ADC. Our recent presence at the 2025 ASCO with eight oral presentations highlights the strength and global competitiveness of our R&D. But this is only the beginning. With a clear vision to advance at least five pipeline assets into MRCT Phase 3 by 2030, we are committed to delivering innovative, high-quality, and accessible cancer treatments to patients worldwide.\" Dual Innovation to Unlock the Future of Oncology: Next-gen IO + Next-gen ADC At the core of Innovent's oncology strategy lies the dual engines of next-generation immunotherapy (IO) and next-generation antibody-drug conjugates (ADC), supported by deep insights in cancer biology and differentiated technology platforms. Dual Innovations of IO+ADC \"We are harnessing deep cancer biology insights, advanced antibody and protein engineering, and differentiated ADC linker-payload technologies to develop broader-spectrum, more potent, and less toxic therapies aimed at transforming the oncology treatment paradigm,\" said Dr. Zhou Hui, SVP of Innovent Oncology R&D. \"Our strategy is designed to target some of the toughest challenges in cancer care, including drug resistance, cold tumors, and improve the efficacy of current IO treatment, while bringing new hope to patients worldwide.\" Keynote speech Global R&D Roadmap: a Clear, Stepwise Development Strategy Innovent's pipeline is guided by a rational, phased IO+ADC combination strategy designed to address tumor heterogeneity and immune escape, evolving through three stages: Next-gen IO + Chemotherapy: to redefine the IO cornerstone Next-gen IO + mAb-ADC / bispecific ADC: to cover expansive tumor types and treatment lines Next-gen IO + Dual-Payload ADC (dpADC): to unlock full potential of IO+ ADC synergy, and reshape cancer treatment Development Strategy Currently its oncology pipeline features nearly 10 next-generation molecules in global development, with multi-regional trials actively underway in the U.S., EU, and Asia. The company also continues to invest in global R&D infrastructure, supported by R&D hubs in Shanghai and San Francisco and antibody and ADC manufacturing capacity exceeding 140,000L. Global Innovation Innovent is rapidly expanding its global innovation footprint, with a 2030 goal to advance at least five pipeline assets into global MRCT Phase 3 trials. Key potential candidates includes: IBI343: innovative CLDN18.2 ADC with site-specific conjugation and a TOPO1 inhibitor payload, demonstrating significant survival benefits in both GC and PDAC IBI363: PD-1/IL-2α-bias fusion protein as next-gen IO to redefine cancer treatment and expand the boundaries of IO responsiveness IBI3009: DLL3 ADC in collaboration with Roche IBI3003: tri-specific T-cell engager targeting BCMA/GPRC5D/CD3 for multiple myeloma IBI3001: EGFR/B7H3 ADC with two synergetic targets covering multiple potential indications IBI3020: CEACAM5 dual-payload ADC as globally the first to enter clinical phase IBI363: Next-Gen IO Redefining Cancer Immunotherapy IBI363 is a global first-in-class PD-1/IL-2α-bias fusion protein, featuring a differentiated molecular design and a dual immune activation mechanism. Emerging clinical data strongly support its mechanism of action in reinvigorating and expanding tumor-specific T cells (TSTs). Next-gen IO IBI363 At ASCO 2025, IBI363 demonstrated breakthrough potential in three hard-to-treat tumor types, with a long tailing effect in prolonged survival benefits: Immune-resistant NSCLC (squamous & Adeno): boosted response rate and extended PFS reflects strong immune activation; median overall survival (mOS) up to 17.5 months in 1.5 mg dose cohorts, 12-month OS rate exceeding 70% for 3 mg dose cohorts, and benefit observed even in PD-L1 low expressers Later-line CRC (3L+): mOS of 16.1 months in monotherapy and only 17.8% OS events occurred in combination with bevacizumab with 9.4 months follow-up, outperforming historical benchmarks Immune-resistant melanoma (mucosal/acral subtypes): confirmed overall response rate (cORR) 23%, median duration of response (mDoR) 14 months, and median OS 14.7 months, showing unprecedented positive response and a long-lasting immunologic tailing effect Development Strategy With two Breakthrough Therapy Designations from the NMPA CDE, two Fast Track Designations from the FDA, IBI363 is advancing rapidly toward registrational development. The first head-to-head trial vs. pembrolizumab in mucosal and acral melanoma was initiated. Meanwhile, IBI363 is in preparation for registrational trails in IO-treated squamous NSCLC, and third-line MSS colorectal cancer. Additional trails for first-line and other solid tumors also under exploration in ongoing PoC studies. Near-term Catalyst High-Potency, Low-toxicity ADC Platforms Synergizing with IO for Broad Indication Coverage ADC Platforms Innovent is rapidly advancing its next-gen ADC pipeline, including: IBI343 (CLDN18.2 ADC): first in PDAC to demonstrate long-term survival benefits (mOS 12.1 months in 2L) IBI3001 (EGFR/B7H3 ADC): dual-targeted ADC with broad potential in solid tumors IBI3020 (CEACAM5 dual payload ADC): designed for high efficacy and low toxicity in treatment-resistant tumors These programs leverage proprietary payloads and linkers, optimized for lower toxicity and high potency, and are poised to synergize with Innovent's IO agents to address broader and deeper indications. Innovent Academy: R&D Engine to Drive Global Innovation Innovent Academy is the company's discovery engine for driving global innovation. The Academy continues to expand its platforms in IO, ADC, T-cell engagers, and cytokines, firmly establishing its leadership in next-gen oncology discovery and translational science to generate 6–8 novel molecules per year. Keynote speech Specifically, for next-gen IO and next-gen ADC dual upgradation, Innovent Academy focuses on: diversified antitumor mechanisms to integrate TME modulation and optimize IO efficacy; dual targeting approaches to overcome tumor heterogeneity and drug resistance. R&D Strategy This framework allows Innovent to systematically escalate efficacy and broaden tumor applicability, laying the foundation for first-in-class and best-in-class combination regimens for cancer treatments. Catalyzing China's Role in Global Oncology Innovation Leading oncology KOLs and principal investigators (PIs) delivered keynote speeches, reflecting on a pivotal moment for China's biotech industry. They emphasized that China's innovation, which is driven by rising translational capabilities, expanding global talent pools, and patient-centric trial execution, has entered a \"Deepseek\" moment, one where Chinese-discovered drugs can lead global standards, not just follow them. \"What we're witnessing is a profound shift,\" said one keynote speaker. \"Innovent's next-generation IO programs like IBI363, with a clear global-first design, and ADC platforms targeting previously untreatable populations, show that Chinese biotech is poised to influence—not just participate in—the next global oncology paradigm.\" The enthusiastic response from investors and KOLs underscores growing confidence in China-originated oncology innovation and reaffirms Innovent's position as it enters a new era of global innovation with a vision to become a global premier biopharmaceutical leader. About Innovent Innovent is a leading biopharmaceutical company founded in 2011 with the mission to empower patients worldwide with affordable, high-quality biopharmaceuticals. The company discovers, develops, manufactures and commercializes innovative medicines that target some of the most intractable diseases. Its pioneering therapies treat cancer, cardiovascular and metabolic, autoimmune and eye diseases. Innovent has launched 16 products in the market. It has 2 new drug applications (NDA) under regulatory review, 4 assets in Phase III or pivotal clinical trials and 15 more molecules in early clinical stage. Innovent partners with over 30 global healthcare companies, including Eli Lilly, Sanofi, Incyte, LG Chem and MD Anderson Cancer Center. Guided by the motto, \"Start with Integrity, Succeed through Action,\" Innovent maintains the highest standard of industry practices and works collaboratively to advance the biopharmaceutical industry so that first-rate pharmaceutical drugs can become widely accessible. For more information, visit www.innoventbio.com, or follow Innovent on Facebook and LinkedIn. Statement: 1) Innovent does not recommend the use of any unapproved drug (s)/indication (s). 2) Ramucirumab (Cyramza) and Selpercatinib (Retsevmo) and Pirtobrutinib (Jaypirca) were developed by Eli Lilly and Company. Forward-Looking Statements This news release may contain certain forward-looking statements that are, by their nature, subject to significant risks and uncertainties. The words \"anticipate\", \"believe\", \"estimate\", \"expect\", \"intend\" and similar expressions, as they relate to Innovent, are intended to identify certain of such forward-looking statements. Innovent does not intend to update these forward-looking statements regularly. These forward-looking statements are based on the existing beliefs, assumptions, expectations, estimates, projections and understandings of the management of Innovent with respect to future events at the time these statements are made. These statements are not a guarantee of future developments and are subject to risks, uncertainties and other factors, some of which are beyond Innovent's control and are difficult to predict. Consequently, actual results may differ materially from information contained in the forward-looking statements as a result of future changes or developments in our business, Innovent's competitive environment and political, economic, legal and social conditions. Innovent, the Directors and the employees of Innovent assume (a) no obligation to correct or update the forward-looking statements contained in this site; and (b) no liability in the event that any of the forward-looking statements does not materialize or turn out to be incorrect.",
      "image_url": "https://mma.prnasia.com/media2/2721571/Keynote_speech.jpg?p=medium600",
      "link": "https://en.prnasia.com/story/494875-0.shtml"
    },
    {
      "title": "Suzlon Energy: Sebi disposes off adjudication proceedings, stock reacts",
      "description": "Suzlon Energy stock saw a turnover of Rs 5.63 crore as 8.36 lakh shares changed hands on BSE today.",
      "image_url": "https://akm-img-a-in.tosshub.com/businesstoday/images/story/202506/68620c3576dd9-suzlon-energy-shares-are-trading-higher-than-the-5-day--10-day--20-day--30-day--50-day--100-day--150-300151519-16x9.jpg",
      "link": "https://www.businesstoday.in/markets/stocks/story/suzlon-energy-sebi-disposes-off-adjudication-proceedings-stock-rises-482367-2025-06-30"
    },
    {
      "title": "“Organisation which did not hoist the tricolour...”: UP Cong chief Ajay Rai slams RSS over call to drop ‘socialism’, ‘secularism’",
      "description": "The News Mill",
      "image_url": "https://thenewsmill.com/wp-content/uploads/2025/06/ANI-20250630040249.jpg",
      "link": "https://thenewsmill.com/2025/06/organisation-which-did-not-hoist-the-tricolour-up-cong-chief-ajay-rai-slams-rss-over-call-to-drop-socialism-secularism/"
    }
  ]
}