{
  "results": [
    {
      "title": "Kaizer Chiefs open talks for THIRD ex-Orlando Pirates star!",
      "description": "Kaizer Chiefs are set to jet off to the Netherlands for their pre-season training and could have a third ex-Orlando Pirates star on the plane...",
      "image_url": "https://www.thesouthafrican.com/wp-content/uploads/2024/09/Nasreddine-Nabi-and-Motaung-Jnr.webp",
      "link": "https://www.thesouthafrican.com/sport/soccer/psl-south-africa/kaizer-chiefs-open-talks-for-third-ex-orlando-pirates-star/"
    },
    {
      "title": "Jamaica's Fraser-Pryce qualifies for 9th World Championships",
      "description": "Jamaica's Fraser-Pryce qualifies for 9th World Championshipsluntu.lamaniSat, 06/28/2025 - 06:31 JAMAICA - Shelly-Ann Fraser-Pryce punched her ticket to a ninth World Championships with a third-placed finish in the 100m at the Jamaican national athletics trials on Friday.Fraser-Pryce, a three-time Olympic gold medallist and 10-time world champion, clocked 10.91sec to finish third in the women's 100m final and secure a berth for the World Championships in Tokyo in September.Tina Clayton won her first national title in a personal best of 10.81 with reigning 200m world champion Shericka Jackson second in 10.88.Tia Clayton, twin sister of Tina, was fastest in the semi-finals but pulled up with an apparent injury in the final.Fraser-Pryce won her first world championships medal at Osaka in 2007 - a silver in the 4x100m relay - before going on to win 10 world titles, five of them in the 100m.In front of a large turnout that included treble world record holder Usain Bolt, she delivered when it mattered most.\"It's been a long journey,\" Fraser-Pryce said after the final. \"But it was not about making the team, it was about celebrating the journey and I am grateful for those who have been part of the journey.\"It takes strength and resilience to have made it so far, but it was always a joy and privilege to represent Jamaica and I hope I will leave a legacy of inspiration to every girl who has a dream for achieving more.\"In the men's 100m final, Paris Olympics silver medallist Kishane Thompson delivered a blistering 9.75sec (wind .8m/sec), his personal best making him the sixth-fastest performer in history.Only Justin Gatlin (9.74), Asafa Powell (9.72), Yohan Blake (9.69) Tyson Gay (9.69) and world record-holder Bolt (9.58) have gone faster.The 23-year-old, who was beaten by just 0.005sec by Noah Lyles in the 100m final at the Paris Games, sliced two hundredths off his previous career best of 9.77 set in June of 2024.Oblique Seville shrugged off concern over a tight hamstring to finish second in 9.83 and Ackeem Blake was third in a personal best of 9.88.",
      "image_url": "https://www.enca.com/sites/default/files/styles/large/public/afp/2025-06/doc-644N29D-@photo0.jpg.webp?itok=DtPM40I_",
      "link": "https://www.enca.com/sport/jamaicas-fraser-pryce-qualifies-9th-world-championships"
    },
    {
      "title": "Dewald Brevis makes emotional return to international cricket: ‘It’s special’",
      "description": "'I had my smile on because I feel that is important and that’s how I want to play cricket – smile and enjoy it.'",
      "image_url": "https://media.citizen.co.za/wp-content/uploads/2025/06/Dewald-Brevis-Proteas.jpg",
      "link": "https://www.citizen.co.za/sport/cricket/dewald-brevis-emotional-return-to-proteas-international-cricket/"
    }
  ]
}